app/controllers/posts_controller.rb

INSERT INTO `posts` (`content`, `created_at`, `updated_at`) VALUES ('what the hell is this?', '2012-09-10 07:24:28', '2012-09-10 07:24:28')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `content` = 'my name is datt', `updated_at` = '2012-09-07 13:01:10' WHERE `posts`.`id` = 2
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])